<a href="https://colab.research.google.com/github/jjbangcode/Python_code_repository/blob/master/Copy_of_example.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
ser =pd.Series([1,2,3])
ser

0    1
1    2
2    3
dtype: int64

# 시리즈(series) : 1차원 배열
# 데이터 프레임(DataFrame) : 2차원 배열

In [0]:
df = pd.DataFrame(ser)
df

   0
0  1
1  2
2  3

In [0]:
df[0]

0    1
1    2
2    3
Name: 0, dtype: int64

In [0]:
df.iloc[0]

0    1
Name: 0, dtype: int64

In [0]:
!git clone https://github.com/jjbangcode/Python_code_repository.git

fatal: destination path 'Python_code_repository' already exists and is not an empty directory.

In [0]:
ls -ltr

total 8
drwxr-xr-x 1 root root 4096 Apr  4 20:20 sample_data/
drwxr-xr-x 3 root root 4096 Apr 12 02:15 Python_code_repository/

In [0]:
df[0][0]
df[0][1]

2

In [0]:
df = pd.DataFrame(data = [[0,1,2],[3,4,5]], index = list('ab'), columns=list('cde'))
df

   c  d  e
a  0  1  2
b  3  4  5

In [0]:
df = pd.DataFrame(data = [[1,2,3],[4,5,6],[7,8,9]], columns=list('abc'))
df_a = df
df_a['a'] = 100
df_a

     a  b  c
0  100  2  3
1  100  5  6
2  100  8  9

In [0]:
df_b = df + 99
df_b

     a    b    c
0  199  101  102
1  199  104  105
2  199  107  108

In [0]:
df = pd.DataFrame([[1,2,3,4],[5,6,7,8]], index = ['a','b'], columns=['가','나','다','라'])
df
ser = df['나']
ser
ser['a']
ser.__getitem__(ser > 3)
df.__getitem__(df>3)

which

     가    나    다  라
a  NaN  NaN  NaN  4
b  5.0  6.0  7.0  8

In [0]:
import numpy as np
df_na = pd.DataFrame([1,2,np.nan])
df_na

     0
0  1.0
1  2.0
2  NaN

In [0]:
df_na.sum()
df_na < 3

       0
0   True
1   True
2  False

In [0]:
df_sax = pd.Series([1,2,3,4])
df_sax
df_sax.sum(axis=0)

10

In [0]:
df_dax = pd.DataFrame([[1,2,3,4],[5,6,7,8]])
df_dax

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [0]:
df_dax.sum(axis=0)
df_dax.sum(axis=1)

0    10
1    26
dtype: int64

In [0]:
df_dax = pd.DataFrame([1,2,3,4],[5,6,7,8])
df_dax

   0
5  1
6  2
7  3
8  4

In [0]:
import numpy as np
df_1 = pd.DataFrame(np.random.randint(1,10,(3,3)),columns=list('ABC'))
df_1
df_2 = pd.DataFrame(np.random.randint(1,10,(3,3)),columns = list('CAB'))
df_2
np.log(df_2)
df_1 + df_2

    A   B   C
0   9  12  11
1  12   7   9
2   7   6  13

In [0]:
try:
  pd.read_csv('file_name')
except Exception as e:
  print(e)

File file_name does not exist

In [0]:
df = pd.DataFrame([[1,2,3,4],[5,6,7,8]],index=['a','b'],columns = ['C1','C2','C3','C4'])
df

   C1  C2  C3  C4
a   1   2   3   4
b   5   6   7   8

In [0]:
df.shape
df.ndim
df.size
df.index
df.columns
df.info()
Series

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, a to b
Data columns (total 4 columns):
C1    2 non-null int64
C2    2 non-null int64
C3    2 non-null int64
C4    2 non-null int64
dtypes: int64(4)
memory usage: 80.0+ bytes

NameError: ignored

In [0]:
s = set([i for i in dir(pd.Series) if not i.startswith("_")])
d = set([i for i in dir(pd.DataFrame) if not i.startswith("_")])

In [0]:
count =0
for i in (s-d):
  count += 1
  print(i, end=", ")
  
  #if(count %4 ==0):
   # print()

SyntaxError: ignored

In [0]:
df_f = pd.read_csv('../data/series_dataframe.csv',
                  usecols=['Member','Series','DataFrame'],
                  encoding='eur-kr')

df_f.head()
df_f.shpae

In [0]:
d = {'a':1,'b':2,'c':3}
ser = pd.Series(d,name='something')
ser

a    1
b    2
c    3
Name: something, dtype: int64

In [0]:
import numpy as np
import pandas as pd

s = pd.Series(np.random.randn(5))
s

0    0.009755
1   -0.023176
2    0.036958
3    0.649140
4   -0.702832
dtype: float64

In [0]:
s1 = pd.Series([1,2,3,4],name='s1')
s2 = pd.Series(['a','b','c','d'],name='s2')
df = pd.DataFrame({'s1':s1,'s2':s2})
df
df['s1']
s1 == df['s1']

0    True
1    True
2    True
3    True
Name: s1, dtype: bool

In [0]:
df_a = pd.DataFrame([s1,s2])
df_a

    0  1  2  3
s1  1  2  3  4
s2  a  b  c  d

# Google drive data mount 해서 파일 로드하기

In [0]:

from google.colab import drive
drive.mount('/content/gdrive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3Aietf%3Awg%3Aoauth%3A2.0%3Aoob&scope=email%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdocs.test%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fdrive.photos.readonly%20https%3A%2F%2Fwww.googleapis.com%2Fauth%2Fpeopleapi.readonly&response_type=code

Enter your authorization code:
··········
Mounted at /content/gdrive

In [0]:
ct = pd.read_csv('/content/gdrive/My Drive/data/2017_college_tuition.csv',encoding='euc-kr')
ct.head()

         학교명 설립구분  평균등록금
0    강릉원주대학교  국공립   4262
1      강원대학교  국공립   4116
2  경남과학기술대학교  국공립   3771
3      경북대학교  국공립   4351
4      경상대학교  국공립   3967

In [0]:
ct.tail()
ct.shape
ct.columns

Index([u'학교명', u'설립구분', u'평균등록금'], dtype='object')

In [0]:
#!pip install chardet
import chardet
def find_encoding(fname):
  r_file = open(fname,'rb').read()
  result = chardet.detect(r_file)
  charenc=result['encoding']
  return charenc

my_encoding1 = find_encoding('/content/gdrive/My Drive/data/2017_college_tuition.csv')
df_1=pd.read_csv('/content/gdrive/My Drive/data/2017_college_tuition.csv',encoding=my_encoding1)
my_encoding1

ct = pd.read_csv('/content/gdrive/My Drive/data/2017_college_tuition.csv',encoding='euc-kr')
ct.head()

ct_s = ct[10:20]
ct_s.head()
ct.__getitem__(slice(10,20)).head()

        학교명 설립구분  평균등록금
10  금오공과대학교  국공립   3769
11  대구교육대학교  국공립   3604
12    목포대학교  국공립   3895
13  목포해양대학교  국공립   3424
14    부경대학교  국공립   4042

In [0]:
ct = pd.read_csv('/content/gdrive/My Drive/data/2014_korea_sat_scores.csv',encoding='euc-kr').dropna(axis=1) # 누락값 삭제
ct.head()

import numpy as np

ct[ct['도수(명)'.decode('utf-8')] < 20000].head()
ct1 = (  (ct['도수(명)'.decode('utf-8')]<20000) & ( ct['비율(%)'.decode('utf-8')] <= 5.0)   )
ct1
ct1.shape

ct2_logic = ct[ct1]
ct2_logic.shape
ct2_logic.head()

    등급     과목  구분점수  도수(명)  비율(%)
0    1  국어 A형   128  13866   4.30
8    9  국어 A형  60미만  12554   3.89
9    1  국어 B형   127  12615   4.45
17   9  국어 B형  59미만  10868   3.83
18   1  수학 A형   137  19675   4.77

In [0]:
ct_ss = ct['도수(명)'.decode('utf-8')]
ct_ss.head()
ct_ss[ct_ss<20000].shape
ct_ss[ct_ss < 20000].head()

0     13866
8     12554
9     12615
16    19943
17    10868
Name: 도수(명), dtype: int64

In [0]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()
titanic.columns

Index([u'survived', u'pclass', u'sex', u'age', u'sibsp', u'parch', u'fare',
       u'embarked', u'class', u'who', u'adult_male', u'deck', u'embark_town',
       u'alive', u'alone'],
      dtype='object')

In [0]:
titanic[ ['age','sex','alive'] ].head()

    age     sex alive
0  22.0    male    no
1  38.0  female   yes
2  26.0  female   yes
3  35.0  female   yes
4  35.0    male    no

In [0]:
titanic[ ['age','sex','alive'] ].isnull().sum()#누락값 갯수 체크

age      177
sex        0
alive      0
dtype: int64

# matrix slicing

In [0]:
import seaborn as sns

diamonds = sns.load_dataset('diamonds')

diamonds.head()

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [0]:

diamonds.isnull().sum()

diamonds.loc[0,'carat']

In [0]:
diamonds.loc[:,'carat'].head()

0    0.23
1    0.21
2    0.23
3    0.29
4    0.31
Name: carat, dtype: float64

In [0]:
diamonds.loc[:,['carat']].head()

   carat
0   0.23
1   0.21
2   0.23
3   0.29
4   0.31

In [0]:
diamonds[['carat']].head()

   carat
0   0.23
1   0.21
2   0.23
3   0.29
4   0.31

In [0]:
diamonds.xs("carat",1).head() #열단위로 조회

0    0.23
1    0.21
2    0.23
3    0.29
4    0.31
Name: carat, dtype: float64

In [0]:
diamonds.iloc[:,[1]].head() #column 추출

       cut
0    Ideal
1  Premium
2     Good
3  Premium
4     Good

In [0]:
diamonds.iloc[[1],:] #row 추출

   carat      cut color clarity  depth  table  price     x     y     z
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31

In [0]:
diamonds.iloc[2:5,1:3]

       cut color
2     Good     E
3  Premium     I
4     Good     J

# 복합검색

In [0]:
diamonds.columns

Index([u'carat', u'cut', u'color', u'clarity', u'depth', u'table', u'price',
       u'x', u'y', u'z'],
      dtype='object')

In [0]:
(   (diamonds['carat']==0.23) & (diamonds['cut']=='Very Good')   ).head()

0    False
1    False
2    False
3    False
4    False
dtype: bool